Podkova/src/DataProcessors/Шиномонтаж/Шиномонтаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Шиномонтаж</name>
  <attributes>
    <name>Бригадир</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

Podkova/src/InformationRegisters/ШМ_Смены/ШМ_Смены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШМ_Смены</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>НомерСмены</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СменаЗакрыта</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ВесКГНачало</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесКГКонец</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяКомпьютера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Podkova/src/InformationRegisters/ШМ_Бригады/ШМ_Бригады.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШМ_Бригады</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ШМ_Должности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Помощник</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяКомпьютера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Podkova/src/InformationRegisters/ШМ_СменныйПроцентШиномонтажника/ШМ_СменныйПроцентШиномонтажника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШМ_СменныйПроцентШиномонтажника</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Процент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
</mdclass:InformationRegister>

Podkova/src/InformationRegisters/ШМ_СменныйПроцентСъемщика/ШМ_СменныйПроцентСъемщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШМ_СменныйПроцентСъемщика</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Процент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
</mdclass:InformationRegister>

Podkova/src/InformationRegisters/ШМ_СменныйПроцентДископравщикаСталь/ШМ_СменныйПроцентДископравщикаСталь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШМ_СменныйПроцентДископравщикаСталь</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Процент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
</mdclass:InformationRegister>

Podkova/src/InformationRegisters/ШМ_СменныйПроцентДископравщикаАлюм/ШМ_СменныйПроцентДископравщикаАлюм.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШМ_СменныйПроцентДископравщикаАлюм</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Процент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
</mdclass:InformationRegister>

Podkova/src/InformationRegisters/ШМ_НоменклатураПрофессии/ШМ_НоменклатураПрофессии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШМ_НоменклатураПрофессии</name>
  <resources>
    <name>ВидОплаты</name>
    <type>
      <types>EnumRef.ШМ_ВидОплатыЗаРаботу</types>
    </type>
  </resources>
  <resources>
    <name>РазмерОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МатериальныйВычет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Материал</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <attributes>
    <name>ИспГрузики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Дископравка</name>
    <type>
      <types>EnumRef.ШМ_Дископравка</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Профессия</name>
    <type>
      <types>CatalogRef.ШМ_Должности</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Podkova/src/Enums/ШМ_ВидОплатыЗаРаботу/ШМ_ВидОплатыЗаРаботу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ШМ_ВидОплатыЗаРаботу</name>
  <enumValues>
    <name>Процент</name>
  </enumValues>
  <enumValues>
    <name>ФиксированнаяСумма</name>
  </enumValues>
</mdclass:Enum>

Podkova/src/Enums/ШМ_Дископравка/ШМ_Дископравка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ШМ_Дископравка</name>
  <enumValues>
    <name>Стальной</name>
  </enumValues>
  <enumValues>
    <name>Лекгосплавный</name>
  </enumValues>
  <enumValues>
    <name>НеДископравка</name>
  </enumValues>
</mdclass:Enum>

Podkova/src/DataProcessors/Шиномонтаж/Forms/Бригада/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ШМ_БригадыСрезПоследних.Период КАК Период,
	               |	ШМ_БригадыСрезПоследних.Должность КАК Должность,
	               |	ШМ_БригадыСрезПоследних.Помощник КАК Помощник,
	               |	ШМ_БригадыСрезПоследних.Сотрудник КАК Сотрудник
	               |ИЗ
	               |	РегистрСведений.ШМ_Смены КАК ШМ_Смены
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШМ_Бригады.СрезПоследних КАК ШМ_БригадыСрезПоследних
	               |		ПО (ШМ_БригадыСрезПоследних.Период >= ШМ_Смены.Период)
	               |			И (ШМ_БригадыСрезПоследних.ИмяКомпьютера = ШМ_Смены.ИмяКомпьютера)
	               |			И (НАЧАЛОПЕРИОДА(ШМ_БригадыСрезПоследних.Период, ДЕНЬ) = НАЧАЛОПЕРИОДА(ШМ_Смены.Период, ДЕНЬ))
	               |ГДЕ
	               |	ШМ_БригадыСрезПоследних.ИмяКомпьютера = &ИмяКомпьютера
	               |	И НАЧАЛОПЕРИОДА(ШМ_БригадыСрезПоследних.Период, ДЕНЬ) = &Период
	               |	И ШМ_Смены.СменаЗакрыта = &СменаЗакрыта";
	
	
	ТекущееРабочееМесто = МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента();
	Запрос.УстановитьПараметр("ИмяКомпьютера", ТекущееРабочееМесто.Наименование);  
	Запрос.УстановитьПараметр("Период", НачалоДня(ТекущаяДата()));   
	Запрос.УстановитьПараметр("СменаЗакрыта", Ложь);
	
	Выборка = Запрос.Выполнить().Выгрузить();
	//СписокСтрокДляУдаления = Новый СписокЗначений;
	//Для Каждого СтрокаВыборка Из Выборка Цикл
	//	СписокСтрокДляУдаления.Добавить(СтрокаВыборка);
	//КонецЦикла;
	//Для Каждого СтрСписокСтрокДляУдаления Из СписокСтрокДляУдаления Цикл
	//	Выборка.Удалить(СтрСписокСтрокДляУдаления.Значение);
	//КонецЦикла;  
	
	Если Выборка.Количество() > 0 Тогда   
		ЭтотОбъект.Кассир = ПользователиКлиентСервер.ТекущийПользователь().ФизическоеЛицо;
	КонецЕсли;
	
	Бригада.Загрузить(Выборка);
КонецПроцедуры

Функция ПолучитьПроцентШиномонтажника(ДатаПроцента)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШМ_СменныйПроцентШиномонтажника.Период,
		|	ШМ_СменныйПроцентШиномонтажника.Процент
		|ИЗ
		|	РегистрСведений.ШМ_СменныйПроцентШиномонтажника КАК ШМ_СменныйПроцентШиномонтажника";
	
	Выборка = Запрос.Выполнить().Выгрузить();
	
	Процент=0;
	
	Для Каждого СтрокаВыборка из Выборка Цикл	
		
		Если НачалоМесяца(СтрокаВыборка.Период)=НачалоМесяца(ДатаПроцента) Тогда
			Процент=СтрокаВыборка.Процент;
			Прервать;
		КонецЕсли;
			
	КонецЦикла;
	
	Возврат Процент;
	
КонецФункции

Функция ПолучитьПроцентСъемщика(ДатаПроцента)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШМ_СменныйПроцентСъемщика.Период,
		|	ШМ_СменныйПроцентСъемщика.Процент
		|ИЗ
		|	РегистрСведений.ШМ_СменныйПроцентСъемщика КАК ШМ_СменныйПроцентСъемщика";
	
	Выборка = Запрос.Выполнить().Выгрузить();
	
	Процент=0;
	
	Для Каждого СтрокаВыборка из Выборка Цикл	
		
		Если НачалоМесяца(СтрокаВыборка.Период)=НачалоМесяца(ДатаПроцента) Тогда
			Процент=СтрокаВыборка.Процент;
			Прервать;
		КонецЕсли;
			
	КонецЦикла;
	
	Возврат Процент;
	
КонецФункции

Функция ПолучитьПроцентДископравщикаСталь(ДатаПроцента)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШМ_СменныйПроцентДископравщикаСталь.Период,
		|	ШМ_СменныйПроцентДископравщикаСталь.Процент
		|ИЗ
		|	РегистрСведений.ШМ_СменныйПроцентДископравщикаСталь КАК ШМ_СменныйПроцентДископравщикаСталь";
	
	Выборка = Запрос.Выполнить().Выгрузить();
	
	Процент=0;
	
	Для Каждого СтрокаВыборка из Выборка Цикл	
		
		Если НачалоМесяца(СтрокаВыборка.Период)=НачалоМесяца(ДатаПроцента) Тогда
			Процент=СтрокаВыборка.Процент;
			Прервать;
		КонецЕсли;
			
	КонецЦикла;
	
	Возврат Процент;
	
КонецФункции

Функция ПолучитьПроцентДископравщикаАлюм(ДатаПроцента)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШМ_СменныйПроцентДископравщикаАлюмСрезПоследних.Процент КАК Процент,
		|	ШМ_СменныйПроцентДископравщикаАлюмСрезПоследних.Период КАК Период
		|ИЗ
		|	РегистрСведений.ШМ_СменныйПроцентДископравщикаАлюм.СрезПоследних(, Период <= &Период) КАК ШМ_СменныйПроцентДископравщикаАлюмСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл	
		Возврат Выборка.Процент;	
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции

Процедура УстановитьПроцентыОплаты()
	
	Константы.ШМ_ПроцентШиномонтажЛетний.Установить(ПолучитьПроцентШиномонтажника(ТекущаяДата()));
	Константы.ШМ_ПроцентСъемЛетний.Установить(ПолучитьПроцентСъемщика(ТекущаяДата()));
	Константы.ШМ_ПроцентДископравкаЛетнийСталь.Установить(ПолучитьПроцентДископравщикаСталь(ТекущаяДата()));
	Константы.ШМ_ПроцентДископравкаЛетнийАлюм.Установить(ПолучитьПроцентДископравщикаАлюм(ТекущаяДата()));
	
	ВыборкаРег=РегистрыСведений.ШМ_НоменклатураПрофессии.Выбрать();
	Пока ВыборкаРег.Следующий() Цикл
		Если ВыборкаРег.Профессия=Справочники.ШМ_Должности.НайтиПоНаименованию("Шиномонтажник") Тогда
			Если ВыборкаРег.ВидОплаты=Перечисления.ШМ_ВидОплатыЗаРаботу.Процент Тогда
				Если ВыборкаРег.РазмерОплаты<>Константы.ШМ_ПроцентШиномонтажЛетний.Получить() Тогда
					МенЗаписи=ВыборкаРег.ПолучитьМенеджерЗаписи();
					МенЗаписи.Прочитать();
					МенЗаписи.РазмерОплаты=Константы.ШМ_ПроцентШиномонтажЛетний.Получить();
					МенЗаписи.Записать();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ВыборкаРег=РегистрыСведений.ШМ_НоменклатураПрофессии.Выбрать();
	Пока ВыборкаРег.Следующий() Цикл
		Если ВыборкаРег.Профессия=Справочники.ШМ_Должности.НайтиПоНаименованию("Съемщик") Тогда
			Если ВыборкаРег.ВидОплаты=Перечисления.ШМ_ВидОплатыЗаРаботу.Процент Тогда
				Если ВыборкаРег.РазмерОплаты<>Константы.ШМ_ПроцентСъемЛетний.Получить() Тогда
					МенЗаписи=ВыборкаРег.ПолучитьМенеджерЗаписи();
					МенЗаписи.Прочитать();
					МенЗаписи.РазмерОплаты=Константы.ШМ_ПроцентСъемЛетний.Получить();
					МенЗаписи.Записать();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ВыборкаРег=РегистрыСведений.ШМ_НоменклатураПрофессии.Выбрать();
	Пока ВыборкаРег.Следующий() Цикл
		Если ВыборкаРег.Профессия=Справочники.ШМ_Должности.НайтиПоНаименованию("Правщик дисков") Тогда
			Если ВыборкаРег.ВидОплаты=Перечисления.ШМ_ВидОплатыЗаРаботу.Процент Тогда
				Если ВыборкаРег.Дископравка=Перечисления.ШМ_Дископравка.Стальной Тогда
				Если ВыборкаРег.РазмерОплаты<>Константы.ШМ_ПроцентДископравкаЛетнийСталь.Получить() Тогда
					МенЗаписи=ВыборкаРег.ПолучитьМенеджерЗаписи();
					МенЗаписи.Прочитать();
					МенЗаписи.РазмерОплаты=Константы.ШМ_ПроцентДископравкаЛетнийСталь.Получить();
					МенЗаписи.Записать();
				КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ВыборкаРег=РегистрыСведений.ШМ_НоменклатураПрофессии.Выбрать();
	Пока ВыборкаРег.Следующий() Цикл
		Если ВыборкаРег.Профессия=Справочники.ШМ_Должности.НайтиПоНаименованию("Правщик дисков") Тогда
			Если ВыборкаРег.ВидОплаты=Перечисления.ШМ_ВидОплатыЗаРаботу.Процент Тогда
				Если ВыборкаРег.Дископравка=Перечисления.ШМ_Дископравка.Лекгосплавный Тогда
				Если ВыборкаРег.РазмерОплаты<>Константы.ШМ_ПроцентДископравкаЛетнийАлюм.Получить() Тогда
					МенЗаписи=ВыборкаРег.ПолучитьМенеджерЗаписи();
					МенЗаписи.Прочитать();
					МенЗаписи.РазмерОплаты=Константы.ШМ_ПроцентДископравкаЛетнийАлюм.Получить();
					МенЗаписи.Записать();
				КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьКассира()
	
	СпрПольз = Справочники.Пользователи.НайтиПоНаименованию(ИмяПользователя()).ПолучитьОбъект();
	СпрПольз.ФизическоеЛицо = Кассир;
	СпрПольз.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Если Кассир.Пустая() Тогда
		Предупреждение("Введите кассира!",,"Ввод кассира");
		Возврат;
	КонецЕсли;
	
	Если ТекущаяСменаЗакрыта() Тогда
		ОткрытьСменуНаСервере();
	Иначе
		//ШрифтПредупреждения=Новый Шрифт;
		//ШрифтПредупреждения.Жирный=Истина;
		//ШрифтПредупреждения.Размер=24;
		ТекстПредупреждения=Новый ФорматированнаяСтрока("Внимание текущая смена "+НачалоСмены()+" не закрыта! Закройте при необходимости смену!",,WebЦвета.Красный);
		Предупреждение(ТекстПредупреждения,,"Закрытие смены");
		//Предупреждение("Внимание текущая смена "+НачалоСмены()+" не закрыта! Закройте при необходимости смену!",,"Закрытие смены");
	КонецЕсли;
	
	Если Вопрос("Изменить состав смены?",РежимДиалогаВопрос.ДаНет,,,"Изменение состава смены",)=КодВозвратаДиалога.Да Тогда
		ОКНаСервере();
		//ШрифтПредупреждения=Новый Шрифт;
		//ШрифтПредупреждения.Жирный=Истина;
		//ШрифтПредупреждения.Размер=24;
		ТекстПредупреждения=Новый ФорматированнаяСтрока("Произведено изменение состава смены!",,WebЦвета.Зеленый);
		Предупреждение(ТекстПредупреждения,,"Изменение состава смены");
		//Предупреждение("Произведено изменение состава смены!",,"Изменение состава смены");
	КонецЕсли;
	
	УстановитьПроцентыОплаты();
	УстановитьКассира();

	ОткрытьФорму("Обработка.Шиномонтаж.Форма.Форма");
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ОКНаСервере()
	
	Для каждого стр из Бригада Цикл
		время = ТекущаяДата();
		
		
		НовыйНаборЗаписей = РегистрыСведений.ШМ_Бригады.СоздатьНаборЗаписей();
		НовыйНаборЗаписей.Отбор.Должность.Установить(Стр.Должность, Истина);
		НовыйНаборЗаписей.Отбор.Помощник.Установить(Стр.Помощник, Истина);
		НовыйНаборЗаписей.Отбор.Период.Установить(время, Истина);
		
		НоваяЗаписьНабора = НовыйНаборЗаписей.Добавить();
		НоваяЗаписьНабора.Должность = Стр.Должность;
		НоваяЗаписьНабора.Период = время;
		НоваяЗаписьНабора.Сотрудник = Стр.Сотрудник;
		НоваяЗаписьНабора.Помощник = Стр.Помощник;  
		ТекущееРабочееМесто = МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента();
		НоваяЗаписьНабора.ИмяКомпьютера = ТекущееРабочееМесто.Наименование;
		НовыйНаборЗаписей.Записать();		
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОткрытьСменуНаСервере()
	
	НоваяЗапись = РегистрыСведений.ШМ_Смены.СоздатьМенеджерЗаписи();
	//НоваяЗапись.Дата = НачалоДня(ТекущаяДата());
	НоваяЗапись.Период = ТекущаяДата();
	НоваяЗапись.НомерСмены = НомерСмены();
	//НоваяЗапись.Период = НачалоДня(ТекущаяДата());
	НоваяЗапись.Период = ТекущаяДата();
	НоваяЗапись.ВесКГНачало=ВесКГНачало;
	НоваяЗапись.ВесКГКонец=ВесКГКонец;
	НоваяЗапись.СменаЗакрыта=Ложь;
	НоваяЗапись.Активность = Истина; 
	ТекущееРабочееМесто = МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента();
	НоваяЗапись.ИмяКомпьютера = ТекущееРабочееМесто.Наименование;
	НоваяЗапись.Записать(Истина);
	
КонецПроцедуры

&НаСервере
Функция НачалоСмены()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШМ_СменыСрезПоследних.Период,
		|	ШМ_СменыСрезПоследних.ИмяКомпьютера,
		|	ШМ_СменыСрезПоследних.НомерСмены КАК НС
		|ИЗ
		|	РегистрСведений.ШМ_Смены.СрезПоследних(&Вчера, ) КАК ШМ_СменыСрезПоследних
		|	ГДЕ ШМ_СменыСрезПоследних.ИмяКомпьютера=&ИмяКомпьютера";

	//Запрос.УстановитьПараметр("Вчера",НачалоДня(ТекущаяДата())-1); 
	ТекущееРабочееМесто = МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента();
	Запрос.УстановитьПараметр("Вчера",ТекущаяДата());
	Запрос.УстановитьПараметр("ИмяКомпьютера",ТекущееРабочееМесто.Наименование);
	Выборка = Запрос.Выполнить().Выгрузить();
		
	
	//Выборка = РегистрыСведений.ШМ_Смены.Выбрать(,,,"Убыв");
	Выборка.Сортировать("Период");
	ПоследнийПериод=Неопределено;
	Для Каждого СтрокаВыборки Из Выборка Цикл
	//Пока Выборка.Следующий() Цикл
		//Возврат Выборка.Период;
		ПоследнийПериод=СтрокаВыборки.Период;
	//Иначе	
	//	Возврат 1;
	КонецЦикла;

	Возврат ПоследнийПериод;
	
КонецФункции

Функция ТекущаяСменаЗакрыта()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШМ_СменыСрезПоследних.Период,
		|	ШМ_СменыСрезПоследних.ИмяКомпьютера,
		|	ШМ_СменыСрезПоследних.СменаЗакрыта,
		|	ШМ_СменыСрезПоследних.НомерСмены КАК НС
		|ИЗ
		|	РегистрСведений.ШМ_Смены.СрезПоследних(&Вчера, ) КАК ШМ_СменыСрезПоследних
		|	ГДЕ ШМ_СменыСрезПоследних.ИмяКомпьютера=&ИмяКомпьютера";

	//Запрос.УстановитьПараметр("Вчера",НачалоДня(ТекущаяДата())-1);  
	ТекущееРабочееМесто = МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента();
	Запрос.УстановитьПараметр("Вчера",ТекущаяДата());
	Запрос.УстановитьПараметр("ИмяКомпьютера",ТекущееРабочееМесто.Наименование);
	Выборка = Запрос.Выполнить().Выгрузить();
		
	
	//Выборка = РегистрыСведений.ШМ_Смены.Выбрать(,,,"Убыв");
	Выборка.Сортировать("Период");
	ПоследнийПериод=Неопределено;
	СменаЗакрыта=Ложь;
	Для Каждого СтрокаВыборки Из Выборка Цикл
	//Пока Выборка.Следующий() Цикл
		//Возврат Выборка.Период;
		ПоследнийПериод=СтрокаВыборки.Период;
		СменаЗакрыта=СтрокаВыборки.СменаЗакрыта;
	//Иначе	
	//	Возврат 1;
	КонецЦикла;

	Возврат СменаЗакрыта;
	
КонецФункции
	
&НаСервере
Функция НомерСмены()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШМ_СменыСрезПоследних.НомерСмены КАК НС,
		|	ШМ_СменыСрезПоследних.ИмяКомпьютера
		|ИЗ
		|	РегистрСведений.ШМ_Смены.СрезПоследних(&Вчера, ) КАК ШМ_СменыСрезПоследних
		|	ГДЕ ШМ_СменыСрезПоследних.ИмяКомпьютера=&ИмяКомпьютера";
	
	//Запрос.УстановитьПараметр("Вчера",НачалоДня(ТекущаяДата())-1);  
	ТекущееРабочееМесто = МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента();
	Запрос.УстановитьПараметр("Вчера",ТекущаяДата());
	Запрос.УстановитьПараметр("ИмяКомпьютера",ТекущееРабочееМесто.Наименование);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.НС + 1;
	Иначе	
		Возврат 1;
	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	//УстановитьПроцентыОплаты();
	Попытка
	ОткрытьФорму("Обработка.Шиномонтаж.Форма.Форма");
	Исключение
	КонецПопытки;
КонецПроцедуры
